Revit 2027 API
AssetPropertyList.RemoveAssetProperty Method
 Remove the AssetProperty from the list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveAssetProperty(
	int index
)
Public Sub RemoveAssetProperty (
	index As Integer
)
public:
void RemoveAssetProperty(
	int index
)
member RemoveAssetProperty :
        index : int -> unit
Parameters
index Int32
 Index to remove the AssetProperty from.
Exceptions
Exception | Condition
ArgumentException |  index is out of range.
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace